In [7]:
import pandas as pd
import numpy as np

# create a dataframe from an array

##### option 1

In [12]:
# creating an  array

data=np.array([
    [1,4],
    [2,5],
    [3,6]
])

In [13]:
# creating a dataframe
df=pd.DataFrame(data,index=['row1','row2','row3'],
            columns=['col1','col2'])

In [14]:
# showing a dataframe
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

#### option 2

In [15]:
data=[
    [1,4],
    [2,5],
    [3,6]
]

In [18]:
pd.DataFrame(data,index=['row1','row2','row3'],columns=['col1','col2'])

      col1  col2
row1     1     4
row2     2     5
row3     3     6

#### creating  a dataframe from a dictonary

In [21]:
# list used for this examlpe
states=['califrnia','texax','florida','newyork']
population=[369258,895623,235689,852369]

In [24]:
# sort teh dictonary withn a dictonary

dict_states={"States":states,"Population":population}

In [26]:
dict_states

{'States': ['califrnia', 'texax', 'florida', 'newyork'],
 'Population': [369258, 895623, 235689, 852369]}

In [29]:
df_population= pd.DataFrame(dict_states)

In [30]:
df_population

      States  Population
0  califrnia      369258
1      texax      895623
2    florida      235689
3    newyork      852369

### creating a dataframe from a csv file

In [36]:
df_exams=pd.read_csv(r"C:\Users\Lenovo\Downloads\StudentsPerformance.csv")

In [37]:
df_exams.head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [38]:
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86